import React, { useEffect } from 'react'
import {
    BrowserRouter as Router,
    Switch,
    Route,
    Link
  } from "react-router-dom";
import { Accordion, Image } from "react-bootstrap";
import './FractalTheory.css'
import peano1 from '../FractalTheory/peano1.PNG'
import kocha1 from '../FractalTheory/kocha1.PNG'
import kocha2 from '../FractalTheory/kocha2.PNG'
import formula1 from '../FractalTheory/formula1.PNG'
import dragon1 from '../FractalTheory/dragon1.PNG'
import n1 from '../FractalTheory/n1.PNG'
import mink1 from '../FractalTheory/mink1.PNG'
import levi1 from '../FractalTheory/levi1.PNG'
import mand1 from '../FractalTheory/mand1.PNG'
import mand2 from '../FractalTheory/mand2.PNG'
import jul1 from '../FractalTheory/jul1.PNG'
import stoh1 from '../FractalTheory/stoh1.PNG'
import plasma1 from '../FractalTheory/plasma1.PNG'



const FractalTheory = () => {
    useEffect(() => {
        console.log('fractal')
     }, [])
    return (
        <>
            <div className='infoContainer'>
                <Accordion defaultActiveKey="0">
                    <Accordion.Item eventKey="0">
                        <Accordion.Header>ЗАГАЛЬНА ІНФОРМАЦІЯ</Accordion.Header>
                        <Accordion.Body>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Поняття <b>фрактал</b> і <b>фрактальна геометрія</b>, що з’явилися в кінці 70-х, із середини 80-х міцно увійшли до ужитку математиків і програмістів. Слово фрактал утворено від латинського “fractus”, що в перекладі означає “той, що складається з фрагментів”. Воно було запропоноване Бенуа Мандельбротом у 1975 році для позначення нерегулярних, але самоподібних структур, якими він займався. Народження фрактальної геометрії прийнято пов’язувати з виходом у 1977 році книги Мандельброта “The Fractal Geometry of Nature”. У його роботах використані наукові результати інших учених, що працювали в період 1875–1925 років у тій же області (Пуанкаре, Фату, Жюліа, Кантор, Хаусдорф). Але тільки у наш час вдалося об’єднати їхні роботи в єдину систему.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Роль фракталів в комп’ютерній графіці сьогодні велика. Вони приходять на допомогу, наприклад, коли потрібно за допомогою декількох коефіцієнтів задати лінії і поверхні дуже складної форми. З погляду комп’ютерної графіки, фрактальна геометрія незамінна під час генерації штучних хмар, гір, поверхні морів. Фактично знайдено спосіб легкого представлення складних  об’єктів, які схожі на природні.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Однією з основних властивостей фракталів є самоподібність. У найпростішому випадку невелика частина фрактала містить інформацію про весь фрактал.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Визначення фрактала, дане Мандельбротом, звучить так: <i> “Фракталом називається структура, що складається з частин, які в якомусь сенсі подібні до цілого”</i>.</p>
                        </Accordion.Body>
                    </Accordion.Item>
                    <Accordion.Item eventKey="1">
                        <Accordion.Header>ГЕОМЕТРИЧНІ ФРАКТАЛИ</Accordion.Header>
                        <Accordion.Body>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Фрактали цього класу найнаочніші. Цей тип фракталів утворюється шляхом простих геометричних побудов. Наприклад, у двомірному випадку їх отримують за допомогою деякої ламаної (або поверхні в тривимірному випадку), званої генератором. За один крок алгоритму кожен з відрізків (складових ламаної) замінюється на ламану-генератор, у відповідному масштабі. У результаті нескінченного повторення цієї процедури, виходить геометричний фрактал.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Перші ідеї фрактальної геометрії виникли в ХІХ ст. Кантор за допомогою простої рекурсивної процедури перетворив лінію на набір незв’язаних крапок (так званий Пил Кантора). Він брав лінію і видаляв центральну третину, після цього повторював те ж саме з відрізками.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Пеано ж намалював особливий вид лінії Пеано (рис. 1). Для її малювання італійський математик взяв квадрат і видалив у ньому нижню сторону. Утворилась крива Пеано 1-го порядку (рис. 1, а). Далі вчений зменшив квадрат рівно вдвічі, і зробив його 4 копії. Дві з них поставив паралельно одна одній, а інші дві ще повернув на чверть обороту в протилежні сторони та з’єднав кінці ліній квадратів трьома однаковими відрізками, довжиною, що дорівнює стороні нового зменшеного квадрата. Утворилась крива Пеано 2-го порядку (рис. 2, б). Процедура повторюється знову: зменшується крива 2-го порядку вдвічі, робиться чотири її копії, дві з яких повертаються, і знову з’єднуються відрізками, які теж зменшені вдвічі (рис. 1, в–е). Повторювати даний алгоритм можна до нескінченності.</p>
                        <Image className='image' src={peano1} rounded/>
                        <p className='imageText'><i>Рис.1. Крива Гільберта-Пеано</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Розглянемо фрактальний об’єкт – <b><i>тріадну криву Коха</i></b>. Побудова кривої починається з відрізка одиничної довжини (рис. 2, а) – це 0-е покоління кривої Коха. Далі кожна ланка (у нульовому поколінні один відрізок) замінюється на утворюючий елемент, позначений на рис. 2, б. У результаті такої заміни виходить наступне покоління кривої Коха. У 1-му поколінні – це крива з чотирьох прямолінійних ланок, кожна завдовжки 1/3. Для отримання 2-го покоління проробляються ті ж дії – кожна ланка замінюється на зменшений утворюючий елемент. Отже, для отримання кожного подальшого покоління, всі ланки попереднього покоління необхідно замінити зменшеним утворюючим елементом. Крива n-го покоління при будь-якому кінцевому n називається передфракталом. При n, прямуючому до нескінченності, крива Коха стає фрактальним об’єктом.</p>
                        <Image className='image' src={kocha1} rounded/>
                        <p className='imageText'><i>Рис. 2. Побудова тріадної кривої Коха</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Дуже цікавим і відомим фракталом є сніжинка Коха. Будується вона на основі рівностороннього трикутника, кожна лінія якого замінюється на 4 лінії, довжини кожної дорівнюють 1/3 від початкової. І якщо ми зробимо нескінченне число ітерацій – отримаємо фрактал – сніжинку Коха нескінченної довжини. Виходить, що нескінченна крива покриває обмежену площу (рис. 3).</p>
                        <Image className='image' src={kocha2} rounded/>
                        <p className='imageText'><i>Рис. 3. Сніжинка Коха</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Розглянемо інший фрактал – “дракон” Хартера-Хейтуея (рис. 4). Вважається, що таку назву фрактал отримав за схожість із традиційними китайськими драконами. Принаймні, так здалося вченим, які вперше його досліджували. Кожна ламана–“дракон” є лише наближенням до фракталу-“дракона” та складається з відрізків. Ламана з номером n складатиметься з 2n відрізків. Довжина кожного дорівнює <span> <Image src={formula1}rounded/></span> , де d – довжина вихідного відрізка. Якщо відрізки пронумерувати числами 0, 1, 2, ... і йти по ламаній, то після кожного відрізка потрібно здійснювати поворот. Напрямок повороту визначається номером k поточного відрізка:</p>
                        <ul>
                            <li>
                                повернути праворуч, якщо k дає залишок 1 від ділення на 4;
                            </li>
                            <li>
                                повернути ліворуч, якщо k дає залишок 3 від ділення на 4;
                            </li>
                            <li>
                                повертати так, як після відрізка з номером k/2, якщо k парне.
                            </li>
                        </ul>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Можна переформулювати ці правила, щоб отримати рекурсивну процедуру побудови ламаних-“драконів”. На кожному кроці потрібно замінити кожний із відрізків, що складають дану ламану, на куточки – сторони рівнобедреного прямокутного трикутника, у якого цей відрізок є основою. При цьому потрібно по черзі відкладати ці трикутники то вліво, то вправо за ходом руху від одного кінця ламаної до іншого.</p>
                        <Image className='image'src={dragon1} rounded/>
                        <p className='imageText'><i>Рис. 4. Побудова “дракона” Хартера–Хейтуея</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;<b><i>Н-фрактал</i></b>. Для побудови цього фракталу будують фігуру у вигляді букви Н (рис. 5), у якої вертикальні і горизонтальні відрізки рівні. Потім до кожної з 4 вершин фігури присвоюється її копія, зменшена в два рази. Знову до кожного кінця (їх вже 16) необхідно присвоювати копії літери Н, зменшені вже в 4 рази. І так далі. Якщо кількість кроків спрямувати в нескінченність, то вийде фрактал, який візуально майже заповнює деякий квадрат. Н-фрактал всюди щільний у ньому. Тобто в будь-якому околі будь-якої точки квадрата знайдуться точки фрактала.</p>
                        <Image className='image' src={n1}/>
                        <p className='imageText'><i>Рис. 5. Н–фрактал</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Крива Мінковського – класичний геометричний фрактал. Ініціатором є відрізок (рис. 6, а), а генератором –  ламана з восьми ланок (дві рівні ланки продовжують одна одну) (рис. 6, б).</p>
                        <Image className='image' src={mink1}/>
                        <p className='imageText'><i>Рис. 6. Побудова кривої Мінковського</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Крива Леві – фрактал, запропонований французьким математиком П.Леві (рис. 7). Отримується, якщо взяти половину квадрата виду з рис.7, а, а потім кожну сторону замінити таким же фрагментом, і, повторюючи цю операцію, ми отримаємо криву Леві (рис. 7, б–г).</p>
                        <Image className='image' src={levi1}/>
                        <p className='imageText'><i>Рис. 7. Побудова кривої Леві</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;У комп’ютерній графіці використання геометричних фракталів необхідне при отриманні зображень дерев, кущів, берегової лінії. Двомірні геометричні фрактали використовуються для створення об’ємних текстур (малюнка на поверхні об’єкта).</p>
                        </Accordion.Body>
                    </Accordion.Item>
                    <Accordion.Item eventKey="2">
                        <Accordion.Header>АЛГЕБРАЇЧНІ ФРАКТАЛИ</Accordion.Header>
                        <Accordion.Body>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Це найбільша група фракталів. Отримують їх за допомогою нелінійних процесів в n-мірних просторах. Найбільше вивчені двомірні процеси. Інтерпретуючи нелінійний ітераційний процес, як дискретну динамічну систему, можна користуватися термінологією теорії цих систем: фазовий портрет, сталий процес, аттрактор і т.д.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Відомо, що нелінійні динамічні системи володіють декількома стійкими станами. Той стан, в якому опинилася динамічна система після деякого числа ітерацій, залежить від її початкового стану. Тому кожен стійкий стан (або як говорять – аттрактор) володіє деякою областю початкових станів, з яких система обов’язково потрапить в дані кінцеві стани. Таким чином, фазовий простір системи розбивається на області тяжіння аттракторів. Якщо фазовим є двомірний простір, то забарвлюючи області тяжіння різними кольорами, можна отримати колірний фазовий портрет цієї системи (ітераційного процесу). Міняючи алгоритм вибору кольору, можна отримати складні фрактальні картини з химерними багатоколірними узорами. Несподіванкою для математиків стала можливість за допомогою примітивних алгоритмів породжувати дуже складні нетривіальні структури.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Як приклад, розглянемо множину Мандельброта (pис. 8, 9). Алгоритм його побудови достатньо простий і заснований на простому ітеративному виразі:</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Z[i + 1]= Z[i] * Z[i] + C (1),</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;де Z[i] і C – комплексні змінні. Ітерації виконуються для кожної стартової точки C прямокутної або квадратної області – підмножини комплексної площини. Ітераційний процес продовжується до тих пір, поки Z[i] не вийде за межі кола радіусу 2, центр якої лежить в точці (0,0) (це означає, що аттрактор динамічної системи знаходиться в нескінченності) або після достатньо великого числа ітерацій (наприклад, 200–500) Z[i] зійдеться до якої-небудь точки кола. Залежно від кількості ітерацій, в перебігу яких Z[i] залишалася усередині кола, можна встановити колір точки C (якщо Z[i] залишається усередині кола протягом достатньої великої кількості ітерацій, ітераційний процес припиняється і ця точка растру забарвлюється в чорний колір).</p>
                        <Image className='image' src={mand1}/>
                        <p className='imageText'><i>Рис. 8. Множина Мандельброта</i></p>
                        <Image className='image' src={mand2}/>
                        <p className='imageText'><i>Рис. 9. Ділянка межі множини Мандельброта, збільшена в 200 разів</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Вищеописаний алгоритм дає наближення до так званої множини Мандельброта. Множині Мандельброта належать точки, які протягом нескінченного числа ітерацій не йдуть в нескінченність (точки мають чорний колір). Точки, що належать межі множини (саме там виникають складні структури) йдуть в нескінченність за кінцеве число ітерацій, а точки за межами множини, йдуть в нескінченність через декілька ітерацій (білий фон).</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Розглянемо ще множину Жюліа, що утворюється за тією ж самою формулою (1), що й множина Мандельброта. Множину Жюліа було винайдено французьким математиком Гастоном Жюліа. Досить дивно, але існують різні типи цієї множин. При малюванні фрактала з використанням різних початкових точок (щоб почати процес ітерацій), генеруються різні зображення. Це може бути застосоване тільки до множини Жюліа.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Вигляд множини Жюліа залежить від значення параметра С. На рис. 10, а зображено множину Жюліа для С=0,27334+0,00742і, а на рис. 10,б для С=-1,25.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Якщо, то множина Жюліа перетворюється в цікаву ламану лінію (рис. 10, в). Казковим килимом стає множина Жюліа для С=і (рис. 10, г).</p>
                        <Image className='image' src={jul1}/>
                        <p className='imageText'><i>Рис. 10. Множина Жюліа з різними параметрами С</i></p>
                        </Accordion.Body>
                    </Accordion.Item>
                    <Accordion.Item eventKey="3">
                        <Accordion.Header>СТОХАСТИЧНІ ФРАКТАЛИ</Accordion.Header>
                        <Accordion.Body>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Ще одним відомим класом фракталів є стохастичні фрактали, які виходять в тому випадку, коли в ітераційному процесі випадковим чином міняти які-небудь його параметри. При цьому утворюються об’єкти дуже схожі на природні – несиметричні дерева, порізані берегові лінії і так далі Двовимірні стохастичні фрактали використовуються при моделюванні рельєфу місцевості і поверхні моря. У зв’язку з цим двовимірні  стохастичні  фрактали  дуже  часто  використовуються під час моделювання різних природних об’єктів: рельєфу  місцевості, поверхні моря тощо (рис. 11).</p>
                        <Image className='image' src={stoh1}/>
                        <p className='imageText'><i>Рис. 11. Використання  стохастичних  фракталів  для моделювання природних об’єктів</i></p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Плазма – найвідоміший стохастичний фрактал (рис. 12). Покроковий алгоритм побудови:</p>
                        <ul>
                            <li>
                                Нехай потрібно заповнити плазмою квадрат  точок.
                            </li>
                            <li>
                                Нехай потрібно заповнити плазмою квадрат  точок.
                            </li>
                            <li>
                                Визначається колір середини кожної сторони як середнє між кольорами інцидентних їй вершин плюс / мінус деяка випадкова величина.
                            </li>
                            <li>
                                Визначається колір центру квадрата як середнє між кутами плюс / мінус деяка випадкова величина.
                            </li>
                            <li>
                                Виходить 4 квадрати із заданими вершинами – для кожного з них повторюється алгоритм з третього кроку.
                            </li>
                        </ul>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Розмах випадкової величини має залежати від розміру квадрата – чим менший квадрат, тим менше відхилення.</p>
                        <Image className='image' src={plasma1}/>
                        <p className='imageText'><i>Рис. 12. Плазма</i></p>
                        
                        </Accordion.Body>
                    </Accordion.Item>
                </Accordion>
            </div>
        </>
    )
}

export default FractalTheory
