import React from 'react'
import { Accordion , Image } from 'react-bootstrap'
import '../Theory.css'
import senscolor1 from '../ColorTheory/pics/senscolor1.PNG'
import formula1 from '../ColorTheory/pics/formula1.PNG'


const ColorTheory = () => {
    return (
        <>
        <h1>Кольорні схеми</h1>
            <div className='infoContainer'>
                <Accordion defaultActiveKey="0">
                    <Accordion.Item eventKey="0">
                        <Accordion.Header>ЗАГАЛЬНА ІНФОРМАЦІЯ</Accordion.Header>
                        <Accordion.Body>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Люди бачать предмети тому, що вони випромінюють або відображають світло. Світло можна розглядати двозначно:  як потік частинок різної енергії (тоді колір світла визначає енергія частинок) або як потік електромагнітних хвиль високої частоти (у цьому випадку колір визначається  довжиною  хвилі).  Ми  розглядатимемо  світло  як  потік електромагнітних хвиль, який після взаємодії з оточуючим середовищем попадає в око, де в результаті фізичної і хімічної реакції виробляються електроімпульси,  що  сприймаються  мозком  людини. Різна  довжина  хвилі  сприймається  людьми як  різний колір (колір – це один із факторів світлового випромінювання).Видиме світло з найбільшою довжиною хвилі буде червоним (780 нанометрів), із найменшою – синім (380 нанометрів). При зміні довжини хвилі кольори плавно переходять один в одний (рис.1). Чисті кольори існують лише при певних довжинах хвилі (наприклад, чистий фіолетовий – при довжині 400 нм). Найбільш чутливе око людини до зелених кольорів (520 нм), потім до червоного і синього. У видимому спектрі людське око розрізняє 120 кольорів. За  допомогою хвильової теорії, висунутої Гюйгенсом у 1678 р., було пояснено багато властивостей світла, зокрема закони відбиття та заломлення.</p>
                        <Image className='image'src={senscolor1} rounded/>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Коли  предмети  випромінюють  світло (такими  є  монітори),  вони мають той колір, який ми бачимо. Коли деякі предмети, наприклад, папір, відбивають світло, то їхній колір визначається кольором світла, що падає на предмет, і кольором, який ці предмети відбивають.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Розглянемо,  як  відбувається  сприйняття  світла  людським  оком. Людське око дуже складна система. Коли очі дивляться на світ – світло попадає в око через рогівку, далі за допомогою кришталика проектується на  сітківку  ока,  де  фоторецептори  перетворюють  світлову  інформацію  в імпульси у нервових волокнах. Сітківка  ока  містить  два  принципово  різні  типи  світлочутливих рецепторів:  палички,  які  володіють  широкою  спектральною  кривою чутливості, внаслідок чого вони не розрізняють довжини хвиль, а отже, і кольору  та  колбочки,  які  характеризуються  вузькими  спектральними кривими і тому володіють чутливістю до кольору. У кожному оці знаходиться  біля 6 млн.  колбочок  і 120 млн.  паличок (приблизно 250 млн. рецепторів на два ока).</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;В  основі  трикомпонентної  теорії  світла  лежить  той  факт,  що  в центральній  частині  сітківки  знаходяться  три  типи  чутливих  до  кольору колбочок,  які  відповідають  за  чутливість до довгих, середніх і коротких хвиль, тобто один тип колбочок реагує на  зелений  колір,  другий – на червоний, а третій – на синій колір. Ці три  кольори  називаються  основними (базовими).</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Якщо на всі три види колбочок діє однаковий рівень енергетичної яскравості,  то  світло  буде  білим.  При  низькому  освітленні  колбочки втрачають свою чутливість, зате зростає чутливість паличок, що забезпечує  нашу  здатність  бачити  при  освітленні  низького  рівня,  тому  колбочки працюють вдень, а палички – вночі.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Отже, колір – це характеристика дії випромінювання на око людини.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Слід зауважити, що колір має і психофізичну природу, тобто сприйняття кольору носить  суб’єктивний  характер  і  залежить  не  тільки  від  фізичних  властивостей світла, а й від інтерпретації світла зоровою системою людини.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Кольори, що існують в природі, діляться на ахроматичні і хроматичні. До групи ахроматичних відносяться всі білі, чорні і проміжні між ними сірі кольори. Група хроматичних кольорів включає всі кольори спектру, а також кольори, яких немає в спектрі, але є результатом змішування спектральних кольорів – золотисті, тютюнові, теракотові, пурпурні і т.д. Промені світла, потрапляючи на сітківку ока, дають відчуття кольору.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Наука,  що  вивчає  колір  і  його  вимірювання,  називається  колориметрією. Вона описує загальні закономірності сприйняття кольору людиною. Основними законами колориметрії є закони змішування кольорів. Ці закони в найбільш повному вигляді були сформульовані в 1853 р. німецьким математиком Германом Грассманом.</p>
                        <ul>
                            <li>
                                <p>&nbsp;&nbsp;&nbsp;&nbsp;Закон тривимірності. Колір виражається в тривимірному просторі. Це означає, що для його опису потрібні три компоненти. Довільні чотири  кольори  знаходяться  в  лінійній  залежності.  Іншими  словами, для будь-якого кольору С можна записати рівняння:</p>
                                <Image className='image'src={formula1} rounded/>
                                <p>&nbsp;&nbsp;&nbsp;&nbsp;де  <i>C1,  C2,  C3</i> – базисні,  лінійно  незалежні  кольори,  <i>k1,  k2,  k3</i> – коефіцієнти, що вказують на кількість змішуваних кольорів.</p>
                            </li>
                            <li>
                                <p>&nbsp;&nbsp;&nbsp;&nbsp;Закон неперервності. Якщо в суміші трьох кольорів один з них змінюється неперервно, а інші залишаються сталими, то колір суміші теж змінюється неперервно.</p>
                            </li>
                            <li>
                                <p>&nbsp;&nbsp;&nbsp;&nbsp;Закон адитивності. Колір суміші залежить тільки від кольорів компонент і не залежить від їх спектральних складових, тобто змішувана компонента в свою чергу може бути отримана змішуванням інших компонент.</p>
                            </li>
                        </ul>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Колір може бути отриманий у процесі випромінювання та в процесі  відбивання, тому існують два протилежних методи опису кольору: система адитивних кольорів і система субтрактивних кольорів. Для математичного опису кольору використовується поняття моделі кольору. Кольори в природі рідко  бувають простими. Більшість кольорових відтінків  утворюється  змішуванням  основних  кольорів.  Спосіб  розкладання кольору на складові компоненти називається моделлю кольору. Вся безліч кольорів, які можуть бути створені в колірній моделі, називається колірним діапазоном.</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;Колірні моделі потрібні для математичного опису спектру кольорів, видимих на екрані монітора, або на скануючих та друкуючих пристроях. Кольори представляються моделлю як результат змішення декількох базових (основних) кольорів, з яких вони складаються. Кожен базовий колір має свій діапазон інтенсивності. При складанні всіх базових кольорів з різною інтенсивністю утворюються кольори, доступні для даної моделі. Колірні діапазони моделей можуть розрізнятися.</p>
                        </Accordion.Body>
                    </Accordion.Item>
                    <Accordion.Item eventKey="1">
                        <Accordion.Header>Accordion Item #2</Accordion.Header>
                        <Accordion.Body>
                        Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod
                        tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim
                        veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea
                        commodo consequat. Duis aute irure dolor in reprehenderit in voluptate
                        velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat
                        cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id
                        est laborum.
                        </Accordion.Body>
                    </Accordion.Item>
                </Accordion>
            </div>
        </>
    )
}

export default ColorTheory
